#include "GroupMap.h"

GroupMap::GroupMap() {
    groupMap["22.Б07-мм"] = "366763";
    groupMap["20.Б04-мм"] = "366045";
    groupMap["20.Б06-мм"] = "366046";
    groupMap["23.Б04-мм"] = "366034";
    groupMap["23.Б05-мм"] = "366035";
    groupMap["23.Б06-мм"] = "366033";
    groupMap["23.Б11-мм"] = "365572";
    groupMap["23.Б15-мм"] = "365573";
    groupMap["23.Б17-мм"] = "389292";
    groupMap["22.Б11-мм"] = "366724";
    groupMap["22.Б15-мм"] = "366725";
    groupMap["21.Б11-мм"] = "365899";
    groupMap["21.Б15-мм"] = "365898";
    groupMap["20.Б11-мм"] = "367402";
    groupMap["22.Б14-мм"] = "366107";
    groupMap["21.Б14-мм"] = "365949";
    groupMap["20.Б14-мм"] = "367079";
    groupMap["23.Б16-мм"] = "366834";
    groupMap["23.Б18-мм"] = "389360";
    groupMap["23.Б13-мм"] = "367026";
    groupMap["22.Б13-мм"] = "365593";
    groupMap["21.Б13-мм"] = "366910";
    groupMap["20.Б13-мм"] = "367435";
    groupMap["23.Б12-мм"] = "367324";
    groupMap["22.Б12-мм"] = "366159";
    groupMap["21.Б12-мм"] = "366012";
    groupMap["20.Б12-мм"] = "367217";
    groupMap["21.Б04-мм"] = "365902";
    groupMap["21.Б05-мм"] = "365901";
    groupMap["21.Б06-мм"] = "365903";
    groupMap["22.Б04-мм"] = "366045";
    groupMap["22.Б05-мм"] = "366046";
    groupMap["22.Б06-мм"] = "366033";
    groupMap["22.Б09-мм"] = "366764";
    groupMap["22.Б10-мм"] = "366765";
    groupMap["22.Б07-мм"] = "366763";
    groupMap["22.Б08-мм"] = "366766";
    groupMap["23.Б11-мм"] = "365572";
    groupMap["23.Б15-мм"] = "365573";
    groupMap["23.Б17-мм"] = "389292";
    groupMap["22.Б11-мм"] = "366724";
    groupMap["22.Б15-мм"] = "366725";
    groupMap["21.Б11-мм"] = "365899";
    groupMap["21.Б15-мм"] = "365898";
    groupMap["20.Б11-мм"] = "367402";
    groupMap["22.Б14-мм"] = "366107";
    groupMap["21.Б14-мм"] = "365949";
    groupMap["20.Б14-мм"] = "367079";
    groupMap["23.Б16-мм"] = "366834";
    groupMap["23.Б18-мм"] = "389360";
    groupMap["23.Б13-мм"] = "367026";
    groupMap["22.Б13-мм"] = "365593";
    groupMap["21.Б13-мм"] = "366910";
    groupMap["20.Б13-мм"] = "367435";
    groupMap["23.Б12-мм"] = "367324";
    groupMap["22.Б12-мм"] = "366159";
    groupMap["21.Б12-мм"] = "366012";
    groupMap["20.Б12-мм"] = "367217";
    groupMap["21.Б04-мм"] = "365902";
    groupMap["21.Б05-мм"] = "365901";
    groupMap["21.Б06-мм"] = "365903";
    groupMap["23.Б07-мм"] = "366598";
    groupMap["23.Б08-мм"] = "366596";
    groupMap["23.Б09-мм"] = "366599";
    groupMap["23.Б10-мм"] = "366597";
    groupMap["21.Б07-мм"] = "367323";
    groupMap["21.Б08-мм"] = "367322";
    groupMap["21.Б09-мм"] = "367321";
    groupMap["21.Б10-мм"] = "367320";
    groupMap["20.Б07-мм"] = "366148";
    groupMap["20.Б08-мм"] = "366150";
    groupMap["20.Б09-мм"] = "366149";
    groupMap["20.Б10-мм"] = "366147";
    groupMap["23.М08-мм"] = "367577";
    groupMap["22.М08-мм"] = "366964";
    groupMap["23.М02-мм"] = "367354";
    groupMap["23.М03-мм"] = "367353";
    groupMap["22.М02-мм"] = "367465";
    groupMap["22.М03-мм"] = "367464";
    groupMap["23.М04-мм"] = "366948";
    groupMap["22.М04-мм"] = "366654";
    groupMap["23.М06-мм"] = "365846";
    groupMap["22.М06-мм"] = "366331";
}


// Метод для получения StudentGroupId по StudentGroupName
std::string GroupMap::getGroupId(const std::string& groupName) const {
    auto it = groupMap.find(groupName);
    if (it != groupMap.end()) {
        return it->second;
    }
    return ""; // Возвращаем пустую строку, если не найдено
}